Управление_по_целям_и_KPI/src/Catalogs/KPI_СтруктураКомпании/KPI_СтруктураКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_СтруктураКомпании</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.KPI_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.KPI_Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РолиОбъектаУправления</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_СтруктураКомпании/KPI_СтруктураКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_СтруктураКомпании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьВСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтруктураУдалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Catalogs/KPI_СтруктураКомпании/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запись                   = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = ТекущийОбъект.Ссылка;
		Запись.Прочитать();
		Запись.СтруктураКомпании = ТекущийОбъект.Ссылка;
		Запись.Период            = ДатаСозданияСтруктуры;
		Запись.Записать();
	КонецЕсли;
	
	Если СоставРолейИзменен Тогда
		Сотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(Объект.Ссылка,ТекущаяДата());
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			КриптоМодуль = KPI_ОбщегоНазначенияСервер.ПолучитьКриптоМодуль();
			КриптоМодуль.ИзменитьСоставРолейСотрудника(Сотрудник);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ДатаСозданияСтруктуры",ЭтаФорма.ДатаСозданияСтруктуры);
	Оповестить("ИзменениеСтруктурыКомпании",,Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ Параметры.Свойство("ДатаСозданияСтруктуры",ЭтаФорма.ДатаСозданияСтруктуры)
			ИЛИ Не ЗначениеЗаполнено(ЭтаФорма.ДатаСозданияСтруктуры) Тогда
			Отказ = Истина;
			KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка! Не указана дата создания элемента структуры.");				
		КонецЕсли;
	Иначе 
		Элементы.ДатаСозданияСтруктуры.Видимость = Ложь;	
	КонецЕсли;
	
	КритерийПоиска = Новый Структура("Имя");
	КритерийРольKPI = "KPI";
	Для Каждого Роль из Метаданные.Роли Цикл
		
		Если Найти(Роль.Имя,КритерийРольKPI) Тогда 
			СтрокаРоль = ЭтаФорма.РолиОбъектаУправления.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРоль,Роль);
			КритерийПоиска.Имя = Роль.Имя;
			НайденаяСтрока     = Объект.РолиОбъектаУправления.НайтиСтроки(КритерийПоиска);
			СтрокаРоль.Выбрано = ЗначениеЗаполнено(НайденаяСтрока);
		КонецЕсли;
		
	КонецЦикла;

	СоставРолейИзменен = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиОбъектаУправленияВыбраноПриИзменении(Элемент)
	
	ТекущиеДаные = Элементы.РолиОбъектаУправления.ТекущиеДанные;
	
	КритерийПоиска     = Новый Структура("Имя");
	КритерийПоиска.Имя = ТекущиеДаные.Имя;
	НайденныеСтроки     = Объект.РолиОбъектаУправления.НайтиСтроки(КритерийПоиска);
	
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		Объект.РолиОбъектаУправления.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Если ТекущиеДаные.Выбрано Тогда 
		СтрокаРоль = Объект.РолиОбъектаУправления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРоль,ТекущиеДаные);		
	КонецЕсли;
	
	СоставРолейИзменен = Истина;
			
КонецПроцедуры
